In [171]:
import pandas as pd
import numpy as np

In [109]:
sales = pd.read_csv('/Users/user/hts-forecast/volume/data/raw/sales_train_evaluation.csv')
cal = pd.read_csv('/Users/user/hts-forecast/volume/data/raw/calendar.csv')

In [110]:
sales.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

In [111]:
#take the dataframe and only present the relevant category
def categorize(frame, category):
    newframe = frame[frame.dept_id == category]
    return newframe

In [112]:
#drop unnecessary columns
def drop_col(frame, columns):
    newframe = frame.copy()
    for i in range(len(columns)): 
        newframe = newframe.drop(columns[i], axis='columns')
    return newframe

In [113]:
#aggregate items from each store 
def aggregate(frame, category_id): 
    newframe = frame.groupby(category_id).sum()
    return newframe

In [122]:
#sum items for each day 
def total_sales(frame, column_name):
    newframe = pd.DataFrame()
    newframe[column_name] = frame.sum()
    newframe2 = newframe.reset_index()
    newframe3 = newframe2.rename(columns={'index':'d'})
    return newframe3

In [115]:
#merge sales with calendar 
def merge_pd(frame1, frame2, merge_index):
    newframe = pd.merge(frame1, frame2, on = merge_index, how = 'inner')
    return newframe

In [150]:
#Encode events to binary values
def events_encode(frame):
    newframe = pd.DataFrame()
    newframe = frame.copy()
    for i in range(len(frame)):
        if type(frame.event_type_1[i-1:i])== str:
            newframe.event_type_1[i-1:i] = 1
        else:
            newframe.event_type_1[i-1:i] = 0
    return newframe

In [117]:
df1 = categorize(sales, 'FOODS_3')
df1.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
2226,FOODS_3_001_CA_1_evaluation,FOODS_3_001,FOODS_3,FOODS,CA_1,CA,1,1,1,1,...,0,0,0,1,0,0,1,0,0,2
2227,FOODS_3_002_CA_1_evaluation,FOODS_3_002,FOODS_3,FOODS,CA_1,CA,0,0,0,0,...,5,1,5,2,1,0,1,0,1,1
2228,FOODS_3_003_CA_1_evaluation,FOODS_3_003,FOODS_3,FOODS,CA_1,CA,0,0,0,0,...,0,0,1,0,0,0,2,2,0,0
2229,FOODS_3_004_CA_1_evaluation,FOODS_3_004,FOODS_3,FOODS,CA_1,CA,0,0,0,0,...,0,1,0,0,1,1,0,2,2,1
2230,FOODS_3_005_CA_1_evaluation,FOODS_3_005,FOODS_3,FOODS,CA_1,CA,1,0,1,2,...,1,2,0,0,0,0,0,1,0,1

In [142]:
df_cs = df1.copy()
df_cs.item_id[2:3] = 'Hello'
df_cs.head()

<ipython-input-142-790709d38098>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_cs.item_id[2:3] = 'Hello'
/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
2226,FOODS_3_001_CA_1_evaluation,FOODS_3_001,FOODS_3,FOODS,CA_1,CA,1,1,1,1,...,0,0,0,1,0,0,1,0,0,2
2227,FOODS_3_002_CA_1_evaluation,FOODS_3_002,FOODS_3,FOODS,CA_1,CA,0,0,0,0,...,5,1,5,2,1,0,1,0,1,1
2228,FOODS_3_003_CA_1_evaluation,Hello,FOODS_3,FOODS,CA_1,CA,0,0,0,0,...,0,0,1,0,0,0,2,2,0,0
2229,FOODS_3_004_CA_1_evaluation,FOODS_3_004,FOODS_3,FOODS,CA_1,CA,0,0,0,0,...,0,1,0,0,1,1,0,2,2,1
2230,FOODS_3_005_CA_1_evaluation,FOODS_3_005,FOODS_3,FOODS,CA_1,CA,1,0,1,2,...,1,2,0,0,0,0,0,1,0,1

In [118]:
dfnew = drop_col(df1, ['id', 'dept_id', 'cat_id', 'store_id', 'state_id'])
dfnew.head()

,item_id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
2226,FOODS_3_001,1,1,1,1,1,0,1,2,1,...,0,0,0,1,0,0,1,0,0,2
2227,FOODS_3_002,0,0,0,0,0,0,0,0,0,...,5,1,5,2,1,0,1,0,1,1
2228,FOODS_3_003,0,0,0,0,0,0,0,0,0,...,0,0,1,0,0,0,2,2,0,0
2229,FOODS_3_004,0,0,0,0,0,0,0,0,0,...,0,1,0,0,1,1,0,2,2,1
2230,FOODS_3_005,1,0,1,2,2,0,1,1,3,...,1,2,0,0,0,0,0,1,0,1

In [119]:
df2 = aggregate(dfnew, 'item_id')
df2.head()

,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,d_10,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
item_id,,,,,,,,,,,,,,,,,,,,,
FOODS_3_001,7,8,7,13,5,8,10,19,14,9,...,4,7,11,4,5,8,11,9,12,13
FOODS_3_002,0,0,0,0,0,0,0,0,0,0,...,33,41,42,41,35,19,23,23,35,26
FOODS_3_003,0,0,0,0,0,0,0,0,0,0,...,11,7,13,10,3,5,7,7,3,6
FOODS_3_004,0,0,0,0,0,0,0,0,0,0,...,3,7,2,1,3,5,4,6,6,2
FOODS_3_005,4,9,3,10,7,12,6,9,12,6,...,7,11,11,11,6,8,13,16,6,16

In [120]:
df2.shape

(823, 1941)

In [123]:
df3 = total_sales(df2, 'FOODS_3')
df3.head()

     d  FOODS_3
0  d_1    16741
1  d_2    16333
2  d_3    12343
3  d_4    13764
4  d_5    10525

In [124]:
df4 = merge_pd(cal, df3, 'd')
df4.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI,FOODS_3
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0,16741
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0,16333
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0,12343
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0,13764
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1,10525

In [125]:
df5 = drop_col(df4, ['wm_yr_wk', 'weekday', 'year', 'd', 'event_name_1',
                     'event_name_2', 'event_type_2', 'snap_CA', 'snap_TX', 'snap_WI'])
df5.head()

         date  wday  month event_type_1  FOODS_3
0  2011-01-29     1      1          NaN    16741
1  2011-01-30     2      1          NaN    16333
2  2011-01-31     3      1          NaN    12343
3  2011-02-01     4      2          NaN    13764
4  2011-02-02     5      2          NaN    10525

In [151]:
df_test = events_encode(df5)
df_test.head()

<ipython-input-150-da660796ced6>:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newframe.event_type_1[i-1:i] = 0
/opt/anaconda3/lib/python3.8/site-packages/pandas/core/indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

         date  wday  month event_type_1  FOODS_3
0  2011-01-29     1      1            0    16741
1  2011-01-30     2      1            0    16333
2  2011-01-31     3      1            0    12343
3  2011-02-01     4      2            0    13764
4  2011-02-02     5      2            0    10525

In [152]:
df_test.groupby('event_type_1').sum()

              wday  month   FOODS_3
event_type_1
0             7757  12291  32911601

In [155]:
df5[df5.event_type_1=='Religious']

            date  wday  month event_type_1  FOODS_3
39    2011-03-09     5      3    Religious    11097
46    2011-03-16     5      3    Religious    11096
50    2011-03-20     2      3    Religious    14635
85    2011-04-24     2      4    Religious    12010
87    2011-04-26     4      4    Religious     8446
184   2011-08-01     3      8    Religious    13086
214   2011-08-31     5      8    Religious    10832
282   2011-11-07     3     11    Religious    14248
333   2011-12-28     5     12    Religious    12842
343   2012-01-07     1      1    Religious    19957
389   2012-02-22     5      2    Religious    12177
396   2012-02-29     5      2    Religious    12422
404   2012-03-08     6      3    Religious    15778
441   2012-04-14     1      4    Religious    20774
442   2012-04-15     2      4    Religious    21646
538   2012-07-20     7      7    Religious    18572
568   2012-08-19     2      8    Religious    22619
636   2012-10-26     7     10    Religious    15700
687   2012-12-16     2     12    Religious    20809
709   2013-01-07     3      1    Religious    16940
746   2013-02-13     5      2    Religious    17783
753   2013-02-20     5      2    Religious    13969
757   2013-02-24     2      2    Religious    21137
794   2013-04-02     4      4    Religious    16356
827   2013-05-05     2      5    Religious    21075
892   2013-07-09     4      7    Religious    19405
922   2013-08-08     6      8    Religious    18321
990   2013-10-15     4     10    Religious    17449
1041  2013-12-05     6     12    Religious    17809
1074  2014-01-07     4      1    Religious    16548
1131  2014-03-05     5      3    Religious    15460
1138  2014-03-12     5      3    Religious    18218
1142  2014-03-16     2      3    Religious    23097
1179  2014-04-22     4      4    Religious    15629
1247  2014-06-29     2      6    Religious    21902
1277  2014-07-29     4      7    Religious    15510
1344  2014-10-04     1     10    Religious    23160
1425  2014-12-24     5     12    Religious    15001
1439  2015-01-07     5      1    Religious    15025
1481  2015-02-18     5      2    Religious    13070
1488  2015-02-25     5      2    Religious    12624
1496  2015-03-05     6      3    Religious    15195
1533  2015-04-11     1      4    Religious    20141
1534  2015-04-12     2      4    Religious    22061
1601  2015-06-18     6      6    Religious    15228
1631  2015-07-18     1      7    Religious    21429
1699  2015-09-24     6      9    Religious    14771
1780  2015-12-14     3     12    Religious    16099
1804  2016-01-07     6      1    Religious    16195
1838  2016-02-10     5      2    Religious    17753
1845  2016-02-17     5      2    Religious    16563
1881  2016-03-24     6      3    Religious    15539
1918  2016-04-30     1      4    Religious    22527
1919  2016-05-01     2      5    Religious    23955

In [132]:
a = event_type_1
df5.a

SyntaxError: invalid syntax (<ipython-input-132-2a209b3a4567>, line 2)

In [159]:
type(df5.event_type_1[39:40])

pandas.core.series.Series

In [164]:
a = df5.event_type_1[39:40]

AttributeError: 'Series' object has no attribute 'remove_index'